# BasicLossFactor Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicLossFactor Constructor
BasicLossFactor Class See Also
---
Creates a basic loss factor object with no loss.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public BasicLossFactor()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
BasicLossFactor()
```

# See Also
BasicLossFactor Class
BasicLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace